sparkfun/Arduino_Apollo3/boards.txt
# Copyright (c) 2020 SparkFun Electronics

# Permission is hereby granted, free of charge, to any person obtaining a copy
# of this software and associated documentation files (the "Software"), to deal
# in the Software without restriction, including without limitation the rights
# to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
# copies of the Software, and to permit persons to whom the Software is
# furnished to do so, subject to the following conditions:

# The above copyright notice and this permission notice shall be included in all
# copies or substantial portions of the Software.

# THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
# IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
# FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
# AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
# LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
# OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
# SOFTWARE.

# Menu Options
menu.loader=Bootloader
menu.svl_baud=SVL Baud Rate
menu.sbl_baud=Ambiq Secure Bootloader Baud Rate



###############################################################

sfe_rba_atp.name=SparkFun RedBoard Artemis ATP
sfe_rba_atp.build.variant=SPARKFUN_REDBOARD_ARTEMIS_ATP
sfe_rba_atp.build.board=SFE_RBA_ATP
sfe_rba_atp.build.mcu=cortex-m4
sfe_rba_atp.build.extra_flags=-DPART_apollo3 -DAM_PACKAGE_BGA -DAM_PART_APOLLO3
sfe_rba_atp.build.defines=
sfe_rba_atp.build.includes=
sfe_rba_atp.build.libs=
sfe_rba_atp.build.libmbed={build.variant.path}/libmbed-os.a
sfe_rba_atp.build.ldscript={build.variant.path}/link_script.ld

# sfe_rba_atp.upload.maximum_size=960000
# sfe_rba_atp.upload.sbl_baud=115200
# sfe_rba_atp.build.arch=APOLLO3
# sfe_rba_atp.build.f_cpu=48000000L
# sfe_rba_atp.build.core=arduino

# sfe_rba_atp.build.preferred_export_format=bin

# sfe_rba_atp.menu.svl_baud.921600=921600
# sfe_rba_atp.menu.svl_baud.460800=460800
# sfe_rba_atp.menu.svl_baud.230400=230400
# sfe_rba_atp.menu.svl_baud.115200=115200
# sfe_rba_atp.menu.svl_baud.57600=57600
# sfe_rba_atp.menu.loader.sparkfun_svl=SparkFun Variable Loader (Recommended)
# sfe_rba_atp.menu.loader.ambiq_sbl=Ambiq Secure Bootloader (Advanced)

# sfe_rba_atp.menu.svl_baud.57600.upload.svl_baud=57600
# sfe_rba_atp.menu.svl_baud.115200.upload.svl_baud=115200
# sfe_rba_atp.menu.svl_baud.230400.upload.svl_baud=230400
# sfe_rba_atp.menu.svl_baud.460800.upload.svl_baud=460800
# sfe_rba_atp.menu.svl_baud.921600.upload.svl_baud=921600

# sfe_rba_atp.menu.loader.ambiq_sbl.upload.tool=ambiq_bin2board
# sfe_rba_atp.menu.loader.ambiq_sbl.build.ldscript={build.variant.path}/linker_scripts/gcc/ambiq_sbl_app.ld

# sfe_rba_atp.menu.loader.sparkfun_svl.upload.tool=sfe_rba_atp_svl
# sfe_rba_atp.menu.loader.sparkfun_svl.build.ldscript={build.variant.path}/linker_scripts/gcc/artemis_sbl_svl_app.ld

###############################################################


